CREATE TEMPORARY TABLE male_first_names (
	first_name text PRIMARY KEY
) ON COMMIT DROP;

CREATE TEMPORARY TABLE female_first_names (
	first_name text PRIMARY KEY
) ON COMMIT DROP;

CREATE TEMPORARY TABLE last_names (
	last_name text PRIMARY KEY
) ON COMMIT DROP;

INSERT INTO male_first_names VALUES
	('Авдей'), ('Авксентий'), ('Агапит'), ('Агафон'), ('Акакий'), ('Акиндин'), ('Александр'), ('Алексей'), ('Альберт'), ('Альвиан'), ('Анатолий'), ('Андрей'), ('Аникита'), ('Антон'), ('Антонин'), ('Анфим'), ('Аристарх'), ('Аркадий'), ('Арсений'), ('Артём'), ('Артемий'), ('Артур'), ('Архипп'), ('Афанасий'),
	('Богдан'), ('Борис'),
	('Вавила'), ('Вадим'), ('Валентин'), ('Валерий'), ('Валерьян'), ('Варлам'), ('Варсонофий'), ('Варфоломей (имя)'), ('Василий'), ('Венедикт'), ('Вениамин (имя)'), ('Викентий (имя)'), ('Виктор (имя)'), ('Виссарион'), ('Виталий'), ('Владимир (имя)'), ('Владислав'), ('Владлен'), ('Влас'), ('Всеволод'), ('Вячеслав'),
	('Гавриил'), ('Галактион'), ('Геласий'), ('Геннадий'), ('Георгий'), ('Герасим'), ('Герман'), ('Германн'), ('Глеб'), ('Гордей'), ('Григорий'),
	('Данакт'), ('Даниил (имя)'), ('Демид (имя)'), ('Демьян'), ('Денис'), ('Дмитрий'), ('Добрыня'), ('Донат (имя)'), ('Дорофей'),
	('Евгений'), ('Евграф'), ('Евдоким'), ('Евсей'), ('Евстафий'), ('Егор'), ('Емельян'), ('Еремей'), ('Ермолай'), ('Ерофей'), ('Ефим'), ('Ефрем'),
	('Ждан'), 
	('Зиновий'),
	('Иакинф'), ('Иван'), ('Игнатий'), ('Игорь'), ('Изот'), ('Илья'), ('Иннокентий'), ('Ираклий (имя)'), ('Ириней'), ('Исидор'), ('Иуда'), ('Иулиан'),
	('Капитон'), ('Ким'), ('Кир'), ('Кирилл'), ('Климент'), ('Кондрат'), ('Конон'), ('Константин'), ('Корнилий'), ('Кузьма'), ('Куприян'),
	('Лаврентий'), ('Лев'), ('Леонид'), ('Леонтий'), ('Логгин'), ('Лука'), ('Лукий'), ('Лукьян'), 
	('Магистриан'), ('Макар'), ('Максим'), ('Мамонт'), ('Марк'), ('Мартын'), ('Матвей'), ('Мелентий'), ('Мина'), ('Мирослав'), ('Митрофан'), ('Михаил'), ('Мстислав'),
	('Назар'), ('Нестор'), ('Никандр'), ('Никанор'), ('Никита'), ('Никифор'), ('Никодим'), ('Николай'), ('Никон'),
	('Олег'), ('Онисим'), ('Онуфрий'),
	('Павел'), ('Паисий'), ('Панкратий'), ('Пантелеймон'), ('Парфений'), ('Пафнутий'), ('Пахомий'), ('Пётр'), ('Платон'), ('Поликарп'), ('Порфирий'), ('Потап'), ('Пров'), ('Прокопий'), ('Протасий'), ('Прохор'),
	('Разумник'), ('Родион'), ('Родослав'), ('Роман'), ('Ростислав'), ('Руслан'),
	('Савва'), ('Савелий'), ('Самуил'), ('Святополк'), ('Святослав'), ('Севастьян'), ('Семён'), ('Серафим'), ('Сергей'), ('Сила'), ('Сильвестр'), ('Созон'), ('Софрон'), ('Спиридон'), ('Станислав'), ('Степан'),
	('Тарас'), ('Тимофей'), ('Тимур'), ('Тит'), ('Тихон'), ('Трифон'), ('Трофим'),
	('Урбан'),
	('Фаддей'), ('Фёдор'), ('Федосей'), ('Федот'), ('Феликс'), ('Феоктист'), ('Филат'), ('Филимон'), ('Филипп'), ('Фирс'), ('Фока'), ('Фома'), ('Фотий'), ('Фрол'),
	('Харитон'), ('Хрисанф'), ('Христофор');
	
	
INSERT INTO female_first_names VALUES
	('Агафья'), ('Аглая'), ('Агния'), ('Агриппина'), ('Аза'), ('Акулина'), ('Алевтина'), ('Александра'), ('Алина'), ('Алла'), ('Анастасия'), ('Ангелина'), ('Анжела'), ('Анжелика'), ('Анна'), ('Антонина'), ('Анфиса'),
	('Валентина'), ('Валерия'), ('Варвара'), ('Василиса'), ('Вера'), ('Вероника'), ('Виктория'),
	('Галина'), ('Глафира'), ('Гликерия'),
	('Дана (женское имя)'), ('Дарья'),
	('Евгения'), ('Евдокия'), ('Евлалия'), ('Евлампия'), ('Евпраксия'), ('Евфросиния'), ('Екатерина'), ('Елена'), ('Елизавета'), ('Епистима'), ('Ермиония'),
	('Жанна'),
	('Зинаида'), ('Злата'), ('Зоя'),
	('Инга'), ('Инесса'), ('Инна'), ('Иоанна'), ('Ираида'), ('Ирина'), ('Ия'),
	('Капитолина'), ('Карина'), ('Каролина'), ('Кира'), ('Клавдия'), ('Ксения'),
	('Лада'), ('Лариса'), ('Лидия'), ('Лилия'), ('Любовь'), ('Людмила'),
	('Маргарита'), ('Марина'), ('Мария'), ('Марфа'), ('Матрёна'), ('Милица'), ('Мирослава'),
	('Надежда'), ('Наталья'), ('Нина'), ('Нонна'),
	('Оксана'), ('Октябрина'), ('Олимпиада'), ('Ольга'),
	('Павлина'), ('Пелагея'), ('Пинна'), ('Полина'), ('Прасковья'),
	('Рада'), ('Раиса'), ('Регина'), ('Римма'), ('Рогнеда'), ('Руслана'),
	('Светлана'), ('Серафима'), ('Снежана'), ('София'),
	('Таисия'), ('Тамара'), ('Татьяна'),
	('Улита'), ('Ульяна'), ('Урсула'),
	('Фаина'), ('Феврония'), ('Фёкла'), ('Феодора'),
	('Целестина'),
	('Юлия'),
	('Яна'), ('Ярослава');
	
INSERT INTO last_names VALUES	
	('Смирнов'), ('Иванов'), ('Кузнецов'), ('Соколов'), ('Попов'), ('Лебедев'), ('Козлов'), ('Новиков'), ('Морозов'), ('Петров'), ('Волков'), ('Соловьёв'), ('Васильев'), ('Зайцев'), ('Павлов'), ('Семёнов'), ('Голубев'), ('Виноградов'), ('Богданов'), ('Воробьёв'), ('Фёдоров'), ('Михайлов'), ('Беляев'), ('Тарасов'), ('Белов'), ('Комаров'), ('Орлов'), ('Киселёв'), ('Макаров'), ('Андреев'), ('Ковалёв'), ('Ильин'), ('Гусев'), ('Титов'), ('Кузьмин'), ('Кудрявцев'), ('Баранов'), ('Куликов'), ('Алексеев'), ('Степанов'), ('Яковлев'), ('Сорокин'), ('Сергеев'),
	('Романов'), ('Захаров'), ('Борисов'), ('Королёв'), ('Герасимов'), ('Пономарёв'), ('Григорьев'), ('Лазарев'), ('Медведев'), ('Ершов'), ('Никитин'), ('Соболев'), ('Рябов'), ('Поляков'), ('Цветков'), ('Данилов'), ('Жуков'), ('Фролов'), ('Журавлёв'), ('Николаев'), ('Крылов'), ('Максимов'), ('Сидоров'), ('Осипов'), ('Белоусов'), ('Федотов'), ('Дорофеев'), ('Егоров'), ('Матвеев'), ('Бобров'), ('Дмитриев'), ('Калинин'), ('Анисимов'), ('Петухов'), ('Антонов'), ('Тимофеев'), ('Никифоров'), ('Веселов'), ('Филиппов'), ('Марков'), ('Большаков'), ('Суханов'),
	('Миронов'), ('Ширяев'), ('Александров'), ('Коновалов'), ('Шестаков'), ('Казаков'), ('Ефимов'), ('Денисов'), ('Громов'), ('Фомин'), ('Давыдов'), ('Мельников'), ('Щербаков'), ('Блинов'), ('Колесников'), ('Карпов'), ('Афанасьев'), ('Власов'), ('Маслов'), ('Исаков'), ('Тихонов'), ('Аксёнов'), ('Гаврилов'), ('Родионов'), ('Котов'), ('Горбунов'), ('Кудряшов'), ('Быков'), ('Зуев'), ('Третьяков'), ('Савельев'), ('Панов'), ('Рыбаков'), ('Суворов'), ('Абрамов'), ('Воронов'), ('Мухин'), ('Архипов'), ('Трофимов'), ('Мартынов'), ('Емельянов'), ('Горшков'),
	('Чернов'), ('Овчинников'), ('Селезнёв'), ('Панфилов'), ('Копылов'), ('Михеев'), ('Галкин'), ('Назаров'), ('Лобанов'), ('Лукин'), ('Беляков'), ('Потапов'), ('Некрасов'), ('Хохлов'), ('Жданов'), ('Наумов'), ('Шилов'), ('Воронцов'), ('Ермаков'), ('Дроздов'), ('Игнатьев'), ('Савин'), ('Логинов'), ('Сафонов'), ('Капустин'), ('Кириллов'), ('Моисеев'), ('Елисеев'), ('Кошелев'), ('Костин'), ('Горбачёв'), ('Орехов'), ('Ефремов'), ('Исаев'), ('Евдокимов'), ('Калашников'), ('Кабанов'), ('Носков'), ('Юдин'), ('Кулагин'), ('Лапин'), ('Прохоров'), ('Нестеров'),
	('Харитонов'), ('Агафонов'), ('Муравьёв'), ('Ларионов'), ('Федосеев'), ('Зимин'), ('Пахомов'), ('Шубин'), ('Игнатов'), ('Филатов'), ('Крюков'), ('Рогов'), ('Кулаков'), ('Терентьев'), ('Молчанов'), ('Владимиров'), ('Артемьев'), ('Гурьев'), ('Зиновьев'), ('Гришин'), ('Кононов'), ('Дементьев'), ('Ситников'), ('Симонов'), ('Мишин'), ('Фадеев'), ('Комиссаров'), ('Мамонтов'), ('Носов'), ('Гуляев'), ('Шаров'), ('Устинов'), ('Вишняков'), ('Евсеев'), ('Лаврентьев'), ('Брагин'), ('Константинов'), ('Корнилов'), ('Авдеев'), ('Зыков'), ('Бирюков'), ('Шарапов'),
	('Никонов'), ('Щукин'), ('Дьячков'), ('Одинцов'), ('Сазонов'), ('Якушев'), ('Красильников'), ('Гордеев'), ('Самойлов'), ('Князев'), ('Беспалов'), ('Уваров'), ('Шашков'), ('Бобылёв'), ('Доронин'), ('Белозёров'), ('Рожков'), ('Самсонов'), ('Мясников'), ('Лихачёв'), ('Буров'), ('Сысоев'), ('Фомичёв'), ('Русаков'), ('Стрелков'), ('Гущин'), ('Тетерин'), ('Колобов'), ('Субботин'), ('Фокин'), ('Блохин'), ('Селиверстов'), ('Пестов'), ('Кондратьев'), ('Силин'), ('Меркушев'), ('Лыткин'), ('Туров');
	
CREATE TEMP TABLE male_names_count ON COMMIT DROP AS 
	SELECT COUNT(*) FROM male_first_names;
	
CREATE TEMP TABLE female_names_count ON COMMIT DROP AS 
	SELECT COUNT(*) FROM female_first_names;
	
CREATE TEMP TABLE last_names_count ON COMMIT DROP AS 
	SELECT COUNT(*) FROM last_names;
	

-- CREATE OR REPLACE FUNCTION generate_full_name RETURNS text AS $$
	

-- $$ LANGUAGE plpgsql;

SELECT * FROM last_names_count;


